tutorial/multi_sphere/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// 宏定义
// xco0 0.0;
xco1 0;
xco2 0.1;

yco1 0.0;
yco2 0.1;

// zco0 0.0;
zco1 0.2;
zco2 0.4;

vertices
(
    // ($xco0 $yco1 $zco0) //0
    // ($xco1 $yco1 $zco0) //1
    // ($xco2 $yco1 $zco0) //2
    // ($xco0 $yco1 $zco1) //3
    // ($xco1 $yco1 $zco1) //4
    // ($xco2 $yco1 $zco1) //5
    // ($xco1 $yco1 $zco2) //6
    // ($xco2 $yco1 $zco2) //7
    // ($xco0 $yco2 $zco0) //8
    // ($xco1 $yco2 $zco0) //9   
    // ($xco2 $yco2 $zco0) //10
    // ($xco0 $yco2 $zco1) //11
    // ($xco1 $yco2 $zco1) //12
    // ($xco2 $yco2 $zco1) //13
    // ($xco1 $yco2 $zco2) //14
    // ($xco2 $yco2 $zco2) //15
    ($xco1 $yco1 $zco1) //0
    ($xco1 $yco2 $zco1) //1
    ($xco1 $yco1 $zco2) //2
    ($xco1 $yco2 $zco2) //3
    ($xco2 $yco1 $zco1) //4
    ($xco2 $yco2 $zco1) //5
    ($xco2 $yco1 $zco2) //6
    ($xco2 $yco2 $zco2) //7
);

blocks          
(
    // hex ( 0  1  9  8  3  4 12 11) (10 10  5) simpleGrading (1 1 1)
    // hex ( 1  2 10  9  4  5 13 12) (60 10  5) simpleGrading (1 1 1)
    // hex ( 4  5 13 12  6  7 15 14) (60 10 10) simpleGrading (1 1 1)
    hex ( 0  4  5  1  2  6  7  3 ) (45 45 90) simpleGrading (1 1 1)
    // hex ( 4  8  9  5  6  10 11 7 ) (60 10 60) simpleGrading (1 1 1)
    // hex ( 8  12 13 9  10 14 15 11) (20 10 60) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall x1 
    (
        (0 2 3 1)
    )
    wall walls
    (
        (0 4 6 2)
        (3 7 5 1)
        (0 1 5 4)
    )
    wall z2
    (
        (2 6 7 3)
    )
    wall x2
    (
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
